1) /Users/fbretal/software/phyto/app/Services/CatalogServiceImpl.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new CatalogStatusException($catalog, CatalogStatus::EDITING);
         }
         $catalog->name = $name;
-        $catalog->save();
+        
         $catalog->empty();
         foreach ($nodes as $nodeType => $list) {
             $list = collect($list)->map(function ($id) use($nodeType) {

2) /Users/fbretal/software/phyto/app/Services/CatalogServiceImpl.php:141    [M] UnwrapArrayReverse

--- Original
+++ New
@@ @@
             throw new CatalogStatusException($catalog, CatalogStatus::EDITING);
         }
         $nodes = $catalog->nodes();
-        foreach (array_reverse($nodes) as $nodeType => $list) {
+        foreach ($nodes as $nodeType => $list) {
             if ($list->isEmpty()) {
                 continue;
             }

3) /Users/fbretal/software/phyto/app/Services/CatalogServiceImpl.php:144    [M] Continue_

--- Original
+++ New
@@ @@
         $nodes = $catalog->nodes();
         foreach (array_reverse($nodes) as $nodeType => $list) {
             if ($list->isEmpty()) {
-                continue;
+                break;
             }
             $catalog->{$nodeType}()->detach($list->map(function ($el) {
                 return $el->getKey();

Timed Out mutants:
==================

Not Covered mutants:
====================
